In [1]:
from pandas import Series, DataFrame

In [2]:
import numpy as np

In [3]:
df = DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
              'key2' : ['one', 'two', 'one', 'two', 'one'],
              'data1' : np.random.randn(5),
              'data2' : np.random.randn(5)})

In [4]:
df

  key1 key2     data1     data2
0    a  one  1.065911  0.047408
1    a  two  0.844435  0.098571
2    b  one  0.344240  0.308730
3    b  two -0.047589 -0.383677
4    a  one -0.460135  1.345454

In [5]:
grouped = df['data1'].groupby(df['key1'])

In [6]:
grouped.mean()

key1
a    0.483403
b    0.148325
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [8]:
means

key1  key2
a     one     0.302888
      two     0.844435
b     one     0.344240
      two    -0.047589
Name: data1, dtype: float64

In [9]:
means.unstack()

key2       one       two
key1
a     0.302888  0.844435
b     0.344240 -0.047589

In [10]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [11]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [12]:
df['data1'].groupby([states, years]).mean() # 相当于重新索引了原始数据表

California  2005    0.844435
            2006    0.344240
Ohio        2005    0.509161
            2006   -0.460135
Name: data1, dtype: float64

In [13]:
df.groupby('key1').mean() # 自动过滤了非数值列 key2

         data1     data2
key1
a     0.483403  0.497144
b     0.148325 -0.037474

In [14]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [15]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  1.065911  0.047408
1    a  two  0.844435  0.098571
4    a  one -0.460135  1.345454
b
  key1 key2     data1     data2
2    b  one  0.344240  0.308730
3    b  two -0.047589 -0.383677

In [16]:
for name, group in df.groupby(['key1','key2']):
    print(name)
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  1.065911  0.047408
4    a  one -0.460135  1.345454
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.844435  0.098571
('b', 'one')
  key1 key2    data1    data2
2    b  one  0.34424  0.30873
('b', 'two')
  key1 key2     data1     data2
3    b  two -0.047589 -0.383677

In [17]:
pieces = dict(list(df.groupby('key1')))

In [18]:
pieces['b']

  key1 key2     data1     data2
2    b  one  0.344240  0.308730
3    b  two -0.047589 -0.383677

In [19]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [20]:
grouped = df.groupby(df.dtypes, axis=1) # 对原始数据表的列进行分组，按数据类型

In [21]:
dict(list(grouped))

{dtype('float64'):       data1     data2
 0  1.065911  0.047408
 1  0.844435  0.098571
 2  0.344240  0.308730
 3 -0.047589 -0.383677
 4 -0.460135  1.345454, dtype('O'):   key1 key2
 0    a  one
 1    a  two
 2    b  one
 3    b  two
 4    a  one}

In [22]:
df.groupby('key1')['data1'] # 和 df['data1'].groupby(df['key1']) 等效，但好像没少打几个字，后面的 df[] 也可以不用写的吧

In [23]:
s_grouped = df.groupby(['key1', 'key2'])['data1']

In [24]:
s_grouped.mean()

key1  key2
a     one     0.302888
      two     0.844435
b     one     0.344240
      two    -0.047589
Name: data1, dtype: float64

In [25]:
people = DataFrame(np.random.randn(5, 5),
                  columns=['a', 'b', 'c', 'd', 'e'],
                  index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [26]:
people

               a         b         c         d         e
Joe     0.679148  0.536003  0.871515 -0.694872  0.476873
Steve   0.193913  0.142188  0.979100  0.474853  0.743590
Wes     1.614532  1.320306  1.264953 -0.862624  1.010078
Jim     0.545279  1.102547 -1.139543 -1.756856  1.229084
Travis -0.885177 -1.263119 -1.068387 -0.596280  0.211283

In [27]:
people.loc[2:3, ['b', 'c']] = np.nan

In [28]:
people

               a         b         c         d         e
Joe     0.679148  0.536003  0.871515 -0.694872  0.476873
Steve   0.193913  0.142188  0.979100  0.474853  0.743590
Wes     1.614532       NaN       NaN -0.862624  1.010078
Jim     0.545279  1.102547 -1.139543 -1.756856  1.229084
Travis -0.885177 -1.263119 -1.068387 -0.596280  0.211283

In [29]:
mapping = {'a':'red', 'b':'red', 'c':'blue',
          'd':'blue', 'e':'red', 'f':'orange'}

In [30]:
by_column = people.groupby(mapping, axis=1) # 用字典进行分组

In [31]:
by_column.sum()

            blue       red
Joe     0.176643  1.692023
Steve   1.453953  1.079691
Wes    -0.862624  2.624610
Jim    -2.896399  2.876909
Travis -1.664666 -1.937012

In [32]:
map_series = Series(mapping)

In [33]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [34]:
people.groupby(map_series, axis=1).count() # 用 Series 进行分组

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [35]:
people.groupby(len).count() # 用函数进行分组

   a  b  c  d  e
3  3  2  2  3  3
5  1  1  1  1  1
6  1  1  1  1  1

In [36]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [37]:
people.groupby([len, key_list]).min() # 想怎么搭配就怎么搭配。。。

              a         b         c         d         e
3 one  0.679148  0.536003  0.871515 -0.862624  0.476873
  two  0.545279  1.102547 -1.139543 -1.756856  1.229084
5 one  0.193913  0.142188  0.979100  0.474853  0.743590
6 two -0.885177 -1.263119 -1.068387 -0.596280  0.211283

In [38]:
import pandas as pd

In [39]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]], names=['cty', 'tenor'])

In [40]:
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [41]:
hier_df = DataFrame(np.random.randn(4, 5), columns=columns)

In [42]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.275011 -2.489949 -0.054694 -0.850560  0.218099
1     -0.510354  0.790245 -0.612748 -0.847899 -0.505440
2      1.890436  1.930951  0.080976  1.304671  0.445415
3     -0.095865  1.208852 -1.232430 -0.957645  0.111341

In [43]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [44]:
df

  key1 key2     data1     data2
0    a  one  1.065911  0.047408
1    a  two  0.844435  0.098571
2    b  one  0.344240  0.308730
3    b  two -0.047589 -0.383677
4    a  one -0.460135  1.345454

In [45]:
grouped = df.groupby('key1')

In [46]:
grouped['data1'].quantile(0.9) # 样本分位数，如果输入没有相应的值，会线性插值

key1
a    1.021616
b    0.305057
Name: data1, dtype: float64

In [47]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [48]:
grouped.agg(peak_to_peak) # 使用自定义聚合函数

         data1     data2
key1
a     1.526046  1.298046
b     0.391829  0.692407

In [49]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.483403  0.824598 -0.460135  0.192150  0.844435  0.955173
b      2.0  0.148325  0.277065 -0.047589  0.050368  0.148325  0.246283

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.065911   3.0  0.497144  0.735103  0.047408  0.072990  0.098571
b     0.344240   2.0 -0.037474  0.489605 -0.383677 -0.210575 -0.037474


           75%       max
key1
a     0.722012  1.345454
b     0.135628  0.308730

In [50]:
tips = pd.read_csv('data/tips.csv')

In [51]:
tips.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [52]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [53]:
tips[:5]

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [54]:
grouped = tips.groupby(['sex', 'smoker'])

In [55]:
grouped_pct = grouped['tip_pct']

In [56]:
grouped_pct.agg('mean') # 和直接调用 mean() 的效果一样

sex     smoker
Female  No        0.156921
        Yes       0.182150
Male    No        0.160669
        Yes       0.152771
Name: tip_pct, dtype: float64

In [57]:
grouped_pct.agg(['mean', 'std', peak_to_peak]) # 可以传入一组函数名

                   mean       std  peak_to_peak
sex    smoker
Female No      0.156921  0.036421      0.195876
       Yes     0.182150  0.071595      0.360233
Male   No      0.160669  0.041849      0.220186
       Yes     0.152771  0.090588      0.674707

In [58]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)]) # 也可以用 tuple 对列名做映射

                    foo       bar
sex    smoker
Female No      0.156921  0.036421
       Yes     0.182150  0.071595
Male   No      0.160669  0.041849
       Yes     0.152771  0.090588

In [59]:
functions = ['count', 'mean', 'max']

In [60]:
result = grouped['tip_pct', 'total_bill'].agg(functions) # 对多个列进行指定的（多个）统计

In [61]:
result

              tip_pct                     total_bill
                count      mean       max      count       mean    max
sex    smoker
Female No          54  0.156921  0.252672         54  18.105185  35.83
       Yes         33  0.182150  0.416667         33  17.977879  44.30
Male   No          97  0.160669  0.291990         97  19.791237  48.33
       Yes         60  0.152771  0.710345         60  22.284500  50.81

In [62]:
result['tip_pct']

               count      mean       max
sex    smoker
Female No         54  0.156921  0.252672
       Yes        33  0.182150  0.416667
Male   No         97  0.160669  0.291990
       Yes        60  0.152771  0.710345

In [63]:
ftuples = [('平均', 'mean'), ('方差', np.var)] # 还是可以自定义名称

In [64]:
grouped['tip_pct', 'total_bill'].agg(ftuples)

                tip_pct           total_bill
                     平均        方差         平均         方差
sex    smoker
Female No      0.156921  0.001327  18.105185  53.092422
       Yes     0.182150  0.005126  17.977879  84.451517
Male   No      0.160669  0.001751  19.791237  76.152961
       Yes     0.152771  0.008206  22.284500  98.244673

In [65]:
grouped.agg({'tip':np.max, 'size':'sum'}) # 用字典对不同列应用不同的函数

                tip  size
sex    smoker
Female No       5.2   140
       Yes      6.5    74
Male   No       9.0   263
       Yes     10.0   150

In [66]:
grouped.agg({'tip_pct':['min', 'max'], 'size':'sum'})

                tip_pct           size
                    min       max  sum
sex    smoker
Female No      0.056797  0.252672  140
       Yes     0.056433  0.416667   74
Male   No      0.071804  0.291990  263
       Yes     0.035638  0.710345  150

In [68]:
key = ['one', 'two', 'one', 'two', 'one']

In [70]:
people.groupby(key).mean()

            a         b         c         d         e
one  0.469501 -0.363558 -0.098436 -0.717925  0.566078
two  0.369596  0.622367 -0.080222 -0.641001  0.986337

In [71]:
people.groupby(key).transform(np.mean) # 对比上一条语句，将分组的处理结果再传播回原始数据上

               a         b         c         d         e
Joe     0.469501 -0.363558 -0.098436 -0.717925  0.566078
Steve   0.369596  0.622367 -0.080222 -0.641001  0.986337
Wes     0.469501 -0.363558 -0.098436 -0.717925  0.566078
Jim     0.369596  0.622367 -0.080222 -0.641001  0.986337
Travis  0.469501 -0.363558 -0.098436 -0.717925  0.566078

In [72]:
def demean(arr):
    return arr - arr.mean()

In [73]:
demeaned = people.groupby(key).transform(demean) # 这个就有点意思了

In [74]:
demeaned

               a         b         c         d         e
Joe     0.209647  0.899561  0.969951  0.023053 -0.089205
Steve  -0.175683 -0.480179  1.059322  1.115855 -0.242747
Wes     1.145031       NaN       NaN -0.144699  0.444000
Jim     0.175683  0.480179 -1.059322 -1.115855  0.242747
Travis -1.354678 -0.899561 -0.969951  0.121645 -0.354795

In [75]:
demeaned.groupby(key).mean() # 确认上一条语句的结果，可以算是零了

                a             b    c             d             e
one -7.401487e-17  0.000000e+00  0.0  7.401487e-17 -1.850372e-17
two  1.387779e-17 -2.775558e-17  0.0  1.110223e-16 -5.551115e-17

In [78]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [79]:
top(tips, n=3)

     total_bill   tip     sex smoker  day    time  size   tip_pct
67         3.07  1.00  Female    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes  Sun  Dinner     2  0.710345

In [80]:
tips.groupby('smoker').apply(top) # 先对分组调用 top，再合并结果

            total_bill   tip     sex smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
       185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
       51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
       149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
       232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [82]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill') # 可以指定参数的

                 total_bill    tip     sex smoker   day    time  size  \
smoker day
No     Fri  94        22.75   3.25  Female     No   Fri  Dinner     2
       Sat  212       48.33   9.00    Male     No   Sat  Dinner     4
       Sun  156       48.17   5.00    Male     No   Sun  Dinner     6
       Thur 142       41.19   5.00    Male     No  Thur   Lunch     5
Yes    Fri  95        40.17   4.73    Male    Yes   Fri  Dinner     4
       Sat  170       50.81  10.00    Male    Yes   Sat  Dinner     3
       Sun  182       45.35   3.50    Male    Yes   Sun  Dinner     3
       Thur 197       43.11   5.00  Female    Yes  Thur   Lunch     4

                  tip_pct
smoker day
No     Fri  94   0.142857
       Sat  212  0.186220
       Sun  156  0.103799
       Thur 142  0.121389
Yes    Fri  95   0.117750
       Sat  170  0.196812
       Sun  182  0.077178
       Thur 197  0.115982

In [83]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip     sex smoker   day    time  size   tip_pct
88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [84]:
frame = DataFrame({'data1': np.random.randn(1000),
                  'data2': np.random.randn(1000)})

In [86]:
factor = pd.cut(frame.data1, 4) # 第七章：按最大最小数值的范围切成四份，然后分门别类

In [90]:
factor[:10]

0     (-0.069, 1.456]
1     (-0.069, 1.456]
2     (-0.069, 1.456]
3      (1.456, 2.981]
4     (-0.069, 1.456]
5     (-0.069, 1.456]
6     (-0.069, 1.456]
7     (-0.069, 1.456]
8     (-0.069, 1.456]
9    (-1.594, -0.069]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.126, -1.594] < (-1.594, -0.069] < (-0.069, 1.456] < (1.456, 2.981]]

In [91]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
           'count': group.count(), 'mean': group.mean()}

In [92]:
grouped = frame.data2.groupby(factor)

In [95]:
grouped.apply(get_stats).unstack()

                       min       max  count      mean
data1
(-3.126, -1.594] -2.257098  2.589383   52.0 -0.134076
(-1.594, -0.069] -2.447001  2.601854  409.0  0.004793
(-0.069, 1.456]  -2.874837  3.371921  462.0 -0.008105
(1.456, 2.981]   -1.651930  2.165151   77.0  0.217897

In [96]:
s = Series(np.random.randn(6))

In [98]:
s[::2] = np.nan

In [101]:
s.fillna(s.mean()) # 用平均值填充 NA 值

0    0.019703
1   -0.269349
2    0.019703
3   -0.048606
4    0.019703
5    0.377065
dtype: float64

In [102]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
         'Orgeon', 'Nevada', 'California', 'Idaho']

In [103]:
group_key = ['East'] * 4 + ['West'] * 4

In [105]:
data = Series(np.random.randn(8), index=states)

In [107]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [108]:
data

Ohio         -0.164836
New York     -0.029172
Vermont            NaN
Florida       0.075257
Orgeon        0.588956
Nevada             NaN
California   -0.163145
Idaho              NaN
dtype: float64

In [109]:
data.groupby(group_key).mean()

East   -0.039584
West    0.212906
dtype: float64

In [110]:
fill_mean = lambda g: g.fillna(g.mean())

In [111]:
data.groupby(group_key).apply(fill_mean) # 对不同的分组填充不同的数值

Ohio         -0.164836
New York     -0.029172
Vermont      -0.039584
Florida       0.075257
Orgeon        0.588956
Nevada        0.212906
California   -0.163145
Idaho         0.212906
dtype: float64

In [112]:
fill_values = {'East':0.5, 'West':-1}

In [113]:
fill_func = lambda g: g.fillna(fill_values[g.name]) # 参照前面遍历 groupby 结果，name 应该是分组名称？

In [114]:
data.groupby(group_key).apply(fill_func)

Ohio         -0.164836
New York     -0.029172
Vermont       0.500000
Florida       0.075257
Orgeon        0.588956
Nevada       -1.000000
California   -0.163145
Idaho        -1.000000
dtype: float64

In [120]:
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2,11)) + ['J', 'Q', 'K']
cards = []
for suit in suits:
    cards.extend(str(num) + suit for num in base_names)
deck = Series(card_val, index=cards)

In [121]:
deck[:14]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
QH     10
KH     10
AS      1
dtype: int64

In [122]:
def draw(deck, n=5):
    return deck.take(np.random.permutation(len(deck))[:n])

In [124]:
draw(deck, 3)

JH    10
3S     3
QD    10
dtype: int64

In [125]:
get_suit = lambda card: card[-1]

In [126]:
deck.groupby(get_suit).apply(draw, n=2) # 每个花色来两张！

C  3C     3
   JC    10
D  5D     5
   2D     2
H  2H     2
   JH    10
S  3S     3
   7S     7
dtype: int64

In [133]:
df = DataFrame({'category': ['a', 'a', 'a', 'a', 'b', 'b', 'b', 'b'],
               'data': np.random.randn(8),
               'weights': np.random.rand(8)})

In [134]:
df

  category      data   weights
0        a -1.752897  0.886676
1        a -0.388211  0.309805
2        a  0.368203  0.987004
3        a  0.834021  0.035106
4        b  1.312146  0.182833
5        b  0.692939  0.194341
6        b  0.040261  0.768342
7        b  0.247494  0.199544

In [135]:
grouped = df.groupby('category')

In [136]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights']) # 加权平均

In [137]:
grouped.apply(get_wavg)

category
a   -0.577766
b    0.338193
dtype: float64